app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("room_number", "title") VALUES (?, ?)  [["room_number", 5], ["title", "Computer Science"]]
---
  def create
    @school_class = SchoolClass.create(post_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "room_number" = ?, "title" = ? WHERE "school_classes"."id" = ?  [["room_number", 10], ["title", "Risk Analysis"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(post_params)